const quotes =[{
  quote:`لو كانتِ الدُّنيا تعدلُ عندَ اللهِ جناحَ بعوضةٍ ما سقى كافرًا منها شَربةَ ماءٍ`
},{
  quote:`لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ`
},{
  quote:` لا يُؤْمِنُ أحدُكم حتى أكونَ أحبَّ إليه من ولدِهِ، ووالدِهِ، والناسِ أجمعينَ `
},{
  quote:`ما شيءٌ أثقلُ في ميزانِ المؤمِنِ يومَ القيامةِ مِن خُلُقٍ حسَنٍ، فإنَّ اللَّهَ تعالى ليُبغِضُ الفاحشَ البَذيءَ `
},{
  quote:` مَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فلا يُؤْذِ جارَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ، ومَن كانَ يُؤْمِنُ باللَّهِ واليَومِ الآخِرِ فَلْيَقُلْ خَيْرًا أوْ لِيَصْمُتْ `
},{
  quote:` ما يُصِيبُ المُؤْمِنَ مِن وصَبٍ، ولا نَصَبٍ، ولا سَقَمٍ، ولا حَزَنٍ حتَّى الهَمِّ يُهَمُّهُ، إلَّا كُفِّرَ به مِن سَيِّئاتِهِ `
},{
  quote:` أحب الأعمال إلى الله، أدومها وإن قلّ `
},{
  quote:` إذا مات ابن آدم، انقطع عنه عمله إلا من ثلاث: صدقة جارية، أو علم ينتفع به، أو ولد صالح يدعو له `
},{
  quote:` دخلت امرأة النار في هِرَّة ربطتها، فلم تطعمها ولم تدعها تأكل من خَشاش الأرض حتى ماتت `
}
]



let btn = document.querySelector("#Next");
let quote = document.querySelector(".quote");
let lastIndex;

btn.addEventListener("click", function(){
  let random;
  do {
    random = Math.floor(Math.random() * quotes.length);
  } while (random === lastIndex);
  lastIndex = random;
  quote.innerHTML = quotes[random].quote;
})






